CSI API ETABS v1
cCaseModalHistoryLinear.SetLoads Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoads(
	string Name,
	int NumberLoads,
	ref string[] LoadType,
	ref string[] LoadName,
	ref string[] Func,
	ref double[] SF,
	ref double[] Tf,
	ref double[] At,
	ref string[] CSys,
	ref double[] Ang
)
Function SetLoads (
	Name As String,
	NumberLoads As Integer,
	ByRef LoadType As String(),
	ByRef LoadName As String(),
	ByRef Func As String(),
	ByRef SF As Double(),
	ByRef Tf As Double(),
	ByRef At As Double(),
	ByRef CSys As String(),
	ByRef Ang As Double()
) As Integer
Dim instance As cCaseModalHistoryLinear
Dim Name As String
Dim NumberLoads As Integer
Dim LoadType As String()
Dim LoadName As String()
Dim Func As String()
Dim SF As Double()
Dim Tf As Double()
Dim At As Double()
Dim CSys As String()
Dim Ang As Double()
Dim returnValue As Integer
returnValue = instance.SetLoads(Name,
	NumberLoads, LoadType, LoadName,
	Func, SF, Tf, At, CSys, Ang)
int SetLoads(
	String^ Name,
	int NumberLoads,
	array<String^>^% LoadType,
	array<String^>^% LoadName,
	array<String^>^% Func,
	array<double>^% SF,
	array<double>^% Tf,
	array<double>^% At,
	array<String^>^% CSys,
	array<double>^% Ang
)
abstract SetLoads :
        Name : string *
        NumberLoads : int *
        LoadType : string[] byref *
        LoadName : string[] byref *
        Func : string[] byref *
        SF : float[] byref *
        Tf : float[] byref *
        At : float[] byref *
        CSys : string[] byref *
        Ang : float[] byref -> int
Parameters
Name
Type: System.String
NumberLoads
Type: System.Int32
LoadType
Type: System.String[]
LoadName
Type: System.String[]
Func
Type: System.String[]
SF
Type: System.Double[]
Tf
Type: System.Double[]
At
Type: System.Double[]
CSys
Type: System.String[]
Ang
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cCaseModalHistoryLinear Interface
ETABSv1 Namespace